app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    one_user = User.find(params[:id])

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Kep Ehlmann"], ["email", "kep@kep.com"], ["password", "woof"], ["created_at", 2017-02-11 19:16:57 UTC], ["updated_at", 2017-02-11 19:16:57 UTC]]
---
  def create
    @user = User.new(user_params)

    if @user.save